Tekla.Structures.Drawing.ReinforcementPulloutElement.Rotation
The rotation of the pull-out.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Rotation.Automatic
Automatic rotation.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Rotation.Plane
Plane rotation.

Tekla.Structures.Drawing.ReinforcementPulloutElement.Rotation.Global
Global 3D rotation.